Revit 2024 API
InSessionPrintSetting Members
The InSessionPrintSetting type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the InSessionPrintSetting
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
PrintParameters
Returns the Parameters of Print Setup.
See Also
InSessionPrintSetting Class
Autodesk.Revit.DB Namespace